package com.behinesprutrol.envo.match.data

object Constants {
    fun getQuestion(): ArrayList<Question>{
        val questionList = ArrayList<Question>()

        val que1 = Question(
            1,"Именно этот шахматный термин, который придумал в 1561 году испанский монах Рюи Лопес де Сегура, происходит от итальянского выражения «выставлять вперед ногу», то есть ставить подножку.",
            "Гамбит","Кульбит",
            "Магнит","Гранит",1
        )
        questionList.add(que1)

        val que2 = Question(
            2,"Этот ирландский велосипедист завоевал зеленую майку на Тур де Франс четыре раза, в 1982, 1983, 1985 и 1989 годах. Его рекорд был побит только в 2000 Эриком Цабелем из Германии.",
        "Бен Алекс","Тим Миллер",
            "Шон Келли ","Морган Грот",3
        )
        questionList.add(que2)

        val que3 = Question(
            3,"Этот ирландский велосипедист завоевал зеленую майку на Тур де Франс четыре раза, в 1982, 1983, 1985 и 1989 годах. Его рекорд был побит только в 2000 Эриком Цабелем из Германии.",
        "Бен Алекс","Тим Миллер",
            "Шон Келли ","Морган Грот",3
        )
        questionList.add(que3)

        val que4 = Question(
            4,"Этот ирландский велосипедист завоевал зеленую майку на Тур де Франс четыре раза, в 1982, 1983, 1985 и 1989 годах. Его рекорд был побит только в 2000 Эриком Цабелем из Германии.",
        "Бен Алекс","Тим Миллер",
            "Шон Келли ","Морган Грот",3
        )
        questionList.add(que4)

        val que5 = Question(
            5,"Этот ирландский велосипедист завоевал зеленую майку на Тур де Франс четыре раза, в 1982, 1983, 1985 и 1989 годах. Его рекорд был побит только в 2000 Эриком Цабелем из Германии.",
            "Бен Алекс","Тим Миллер",
            "Шон Келли ","Морган Грот",3
        )
        questionList.add(que5)

        val que6 = Question(
            6,"Этот ирландский велосипедист завоевал зеленую майку на Тур де Франс четыре раза, в 1982, 1983, 1985 и 1989 годах. Его рекорд был побит только в 2000 Эриком Цабелем из Германии.",
            "Бен Алекс","Тим Миллер",
            "Шон Келли ","Морган Грот",3
        )
        questionList.add(que6)

        val que7 = Question(
            7,"Этот ирландский велосипедист завоевал зеленую майку на Тур де Франс четыре раза, в 1982, 1983, 1985 и 1989 годах. Его рекорд был побит только в 2000 Эриком Цабелем из Германии.",
            "Бен Алекс","Тим Миллер",
            "Шон Келли ","Морган Грот",3
        )
        questionList.add(que7)
        return questionList
    }
}